#+startup: folded indent
#+property: header-args:R :results value :session *R:dataset* :colnames yes

*** List

#+begin_src R :rownames yes :exports both
pacman::p_data(datasets)
#+end_src

#+RESULTS:
|     | Data                   | Description                                                     |
|-----+------------------------+-----------------------------------------------------------------|
|   1 | AirPassengers          | Monthly Airline Passenger Numbers 1949-1960                     |
|   2 | BJsales                | Sales Data with Leading Indicator                               |
|   3 | BJsales.lead (BJsales) | Sales Data with Leading Indicator                               |
|   4 | BOD                    | Biochemical Oxygen Demand                                       |
|   5 | CO2                    | Carbon Dioxide Uptake in Grass Plants                           |
|   6 | ChickWeight            | Weight versus age of chicks on different diets                  |
|   7 | DNase                  | Elisa assay of DNase                                            |
|   8 | EuStockMarkets         | Daily Closing Prices of Major European Stock Indices, 1991-1998 |
|   9 | Formaldehyde           | Determination of Formaldehyde                                   |
|  10 | HairEyeColor           | Hair and Eye Color of Statistics Students                       |
|  11 | Harman23.cor           | Harman Example 2.3                                              |
|  12 | Harman74.cor           | Harman Example 7.4                                              |
|  13 | Indometh               | Pharmacokinetics of Indomethacin                                |
|  14 | InsectSprays           | Effectiveness of Insect Sprays                                  |
|  15 | JohnsonJohnson         | Quarterly Earnings per Johnson & Johnson Share                  |
|  16 | LakeHuron              | Level of Lake Huron 1875-1972                                   |
|  17 | LifeCycleSavings       | Intercountry Life-Cycle Savings Data                            |
|  18 | Loblolly               | Growth of Loblolly pine trees                                   |
|  19 | Nile                   | Flow of the River Nile                                          |
|  20 | Orange                 | Growth of Orange Trees                                          |
|  21 | OrchardSprays          | Potency of Orchard Sprays                                       |
|  22 | PlantGrowth            | Results from an Experiment on Plant Growth                      |
|  23 | Puromycin              | Reaction Velocity of an Enzymatic Reaction                      |
|  24 | Seatbelts              | Road Casualties in Great Britain 1969-84                        |
|  25 | Theoph                 | Pharmacokinetics of Theophylline                                |
|  26 | Titanic                | Survival of passengers on the Titanic                           |
|  27 | ToothGrowth            | The Effect of Vitamin C on Tooth Growth in Guinea Pigs          |
|  28 | UCBAdmissions          | Student Admissions at UC Berkeley                               |
|  29 | UKDriverDeaths         | Road Casualties in Great Britain 1969-84                        |
|  30 | UKgas                  | UK Quarterly Gas Consumption                                    |
|  31 | USAccDeaths            | Accidental Deaths in the US 1973-1978                           |
|  32 | USArrests              | Violent Crime Rates by US State                                 |
|  33 | USJudgeRatings         | Lawyers' Ratings of State Judges in the US Superior Court       |
|  34 | USPersonalExpenditure  | Personal Expenditure Data                                       |
|  35 | UScitiesD              | Distances Between European Cities and Between US Cities         |
|  36 | VADeaths               | Death Rates in Virginia (1940)                                  |
|  37 | WWWusage               | Internet Usage per Minute                                       |
|  38 | WorldPhones            | The World's Telephones                                          |
|  39 | ability.cov            | Ability and Intelligence Tests                                  |
|  40 | airmiles               | Passenger Miles on Commercial US Airlines, 1937-1960            |
|  41 | airquality             | New York Air Quality Measurements                               |
|  42 | anscombe               | Anscombe's Quartet of 'Identical' Simple Linear Regressions     |
|  43 | attenu                 | The Joyner-Boore Attenuation Data                               |
|  44 | attitude               | The Chatterjee-Price Attitude Data                              |
|  45 | austres                | Quarterly Time Series of the Number of Australian Residents     |
|  46 | beaver1 (beavers)      | Body Temperature Series of Two Beavers                          |
|  47 | beaver2 (beavers)      | Body Temperature Series of Two Beavers                          |
|  48 | cars                   | Speed and Stopping Distances of Cars                            |
|  49 | chickwts               | Chicken Weights by Feed Type                                    |
|  50 | co2                    | Mauna Loa Atmospheric CO2 Concentration                         |
|  51 | crimtab                | Student's 3000 Criminals Data                                   |
|  52 | discoveries            | Yearly Numbers of Important Discoveries                         |
|  53 | esoph                  | Smoking, Alcohol and (O)esophageal Cancer                       |
|  54 | euro                   | Conversion Rates of Euro Currencies                             |
|  55 | euro.cross (euro)      | Conversion Rates of Euro Currencies                             |
|  56 | eurodist               | Distances Between European Cities and Between US Cities         |
|  57 | faithful               | Old Faithful Geyser Data                                        |
|  58 | fdeaths (UKLungDeaths) | Monthly Deaths from Lung Diseases in the UK                     |
|  59 | freeny                 | Freeny's Revenue Data                                           |
|  60 | freeny.x (freeny)      | Freeny's Revenue Data                                           |
|  61 | freeny.y (freeny)      | Freeny's Revenue Data                                           |
|  62 | infert                 | Infertility after Spontaneous and Induced Abortion              |
|  63 | iris                   | Edgar Anderson's Iris Data                                      |
|  64 | iris3                  | Edgar Anderson's Iris Data                                      |
|  65 | islands                | Areas of the World's Major Landmasses                           |
|  66 | ldeaths (UKLungDeaths) | Monthly Deaths from Lung Diseases in the UK                     |
|  67 | lh                     | Luteinizing Hormone in Blood Samples                            |
|  68 | longley                | Longley's Economic Regression Data                              |
|  69 | lynx                   | Annual Canadian Lynx trappings 1821-1934                        |
|  70 | mdeaths (UKLungDeaths) | Monthly Deaths from Lung Diseases in the UK                     |
|  71 | morley                 | Michelson Speed of Light Data                                   |
|  72 | mtcars                 | Motor Trend Car Road Tests                                      |
|  73 | nhtemp                 | Average Yearly Temperatures in New Haven                        |
|  74 | nottem                 | Average Monthly Temperatures at Nottingham, 1920-1939           |
|  75 | npk                    | Classical N, P, K Factorial Experiment                          |
|  76 | occupationalStatus     | Occupational Status of Fathers and their Sons                   |
|  77 | precip                 | Annual Precipitation in US Cities                               |
|  78 | presidents             | Quarterly Approval Ratings of US Presidents                     |
|  79 | pressure               | Vapor Pressure of Mercury as a Function of Temperature          |
|  80 | quakes                 | Locations of Earthquakes off Fiji                               |
|  81 | randu                  | Random Numbers from Congruential Generator RANDU                |
|  82 | rivers                 | Lengths of Major North American Rivers                          |
|  83 | rock                   | Measurements on Petroleum Rock Samples                          |
|  84 | sleep                  | Student's Sleep Data                                            |
|  85 | stack.loss (stackloss) | Brownlee's Stack Loss Plant Data                                |
|  86 | stack.x (stackloss)    | Brownlee's Stack Loss Plant Data                                |
|  87 | stackloss              | Brownlee's Stack Loss Plant Data                                |
|  88 | state.abb (state)      | US State Facts and Figures                                      |
|  89 | state.area (state)     | US State Facts and Figures                                      |
|  90 | state.center (state)   | US State Facts and Figures                                      |
|  91 | state.division (state) | US State Facts and Figures                                      |
|  92 | state.name (state)     | US State Facts and Figures                                      |
|  93 | state.region (state)   | US State Facts and Figures                                      |
|  94 | state.x77 (state)      | US State Facts and Figures                                      |
|  95 | sunspot.month          | Present                                                         |
|  96 | sunspot.year           | Yearly Sunspot Data, 1700-1988                                  |
|  97 | sunspots               | Monthly Sunspot Numbers, 1749-1983                              |
|  98 | swiss                  | Swiss Fertility and Socioeconomic Indicators (1888) Data        |
|  99 | treering               | Yearly Treering Data, -6000-1979                                |
| 100 | trees                  | Diameter, Height and Volume for Black Cherry Trees              |
| 101 | uspop                  | Populations Recorded by the US Census                           |
| 102 | volcano                | Topographic Information on Auckland's Maunga Whau Volcano       |
| 103 | warpbreaks             | The Number of Breaks in Yarn during Weaving                     |
| 104 | women                  | Average Heights and Weights for American Women                  |

*** iris

- =data.frame=
- Sepal = がく片 (花の付け根部分)
- Petal = 花弁
- 変数
  - Sepal.Length
  - Sepal.Width
  - Petal.Length
  - Petal.Width
  - Species (3 factors: setosa, versicolor, virginica (アヤメ属の 3 種))

#+begin_src R :results output code :exports both
data(iris)
str(iris)
#+end_src

#+RESULTS:
#+begin_src R

'data.frame':	150 obs. of  5 variables:
 $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...
#+end_src

#+begin_src R :exports both
head(iris)
#+end_src

#+RESULTS:
| Sepal.Length | Sepal.Width | Petal.Length | Petal.Width | Species |
|--------------+-------------+--------------+-------------+---------|
|          5.1 |         3.5 |          1.4 |         0.2 | setosa  |
|          4.9 |           3 |          1.4 |         0.2 | setosa  |
|          4.7 |         3.2 |          1.3 |         0.2 | setosa  |
|          4.6 |         3.1 |          1.5 |         0.2 | setosa  |
|            5 |         3.6 |          1.4 |         0.2 | setosa  |
|          5.4 |         3.9 |          1.7 |         0.4 | setosa  |

*** mtcars

- 32 車種のデータ
- =data.frame=
- A data frame with 32 observations on 11 (numeric) variables.
  - [, 1]  mpg   Miles/(US) gallon                        
  - [, 2]  cyl   Number of cylinders                      
  - [, 3]  disp  Displacement (cu.in.)                    
  - [, 4]  hp    Gross horsepower                         
  - [, 5]  drat  Rear axle ratio                          
  - [, 6]  wt    Weight (1000 lbs)                        
  - [, 7]  qsec  1/4 mile time                            
  - [, 8]  vs    Engine (0 = V-shaped, 1 = straight)      
  - [, 9]  am    Transmission (0 = automatic, 1 = manual) 
  - [,10]  gear  Number of forward gears                  
  - [,11]  carb  Number of carburetors                    

#+begin_src R :results output code :exports both
str(mtcars)
#+end_src

#+RESULTS:
#+begin_src R
'data.frame':	32 obs. of  11 variables:
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : num  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : num  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : num  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : num  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: num  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: num  4 4 1 1 2 1 4 2 2 4 ...
#+end_src

#+begin_src R :rownames yes :exports both
head(mtcars)
#+end_src

#+RESULTS:
|                   |  mpg | cyl | disp |  hp | drat |    wt |  qsec | vs | am | gear | carb |
|-------------------+------+-----+------+-----+------+-------+-------+----+----+------+------|
| Mazda RX4         |   21 |   6 |  160 | 110 |  3.9 |  2.62 | 16.46 |  0 |  1 |    4 |    4 |
| Mazda RX4 Wag     |   21 |   6 |  160 | 110 |  3.9 | 2.875 | 17.02 |  0 |  1 |    4 |    4 |
| Datsun 710        | 22.8 |   4 |  108 |  93 | 3.85 |  2.32 | 18.61 |  1 |  1 |    4 |    1 |
| Hornet 4 Drive    | 21.4 |   6 |  258 | 110 | 3.08 | 3.215 | 19.44 |  1 |  0 |    3 |    1 |
| Hornet Sportabout | 18.7 |   8 |  360 | 175 | 3.15 |  3.44 | 17.02 |  0 |  0 |    3 |    2 |
| Valiant           | 18.1 |   6 |  225 | 105 | 2.76 |  3.46 | 20.22 |  1 |  0 |    3 |    1 |

*** sleep

- 2 種類の睡眠薬を同じ 10 名の患者に投与したときの睡眠時間の長さのデータ
  - extra 列：睡眠時間の長さ
  - group 列：睡眠薬の種類
  - ID 列：患者の ID

#+begin_src R :results output code :exports both
str(sleep)
#+end_src

#+RESULTS:
#+begin_src R
'data.frame':	20 obs. of  3 variables:
 $ extra: num  0.7 -1.6 -0.2 -1.2 -0.1 3.4 3.7 0.8 0 2 ...
 $ group: Factor w/ 2 levels "1","2": 1 1 1 1 1 1 1 1 1 1 ...
 $ ID   : Factor w/ 10 levels "1","2","3","4",..: 1 2 3 4 5 6 7 8 9 10 ...
#+end_src

#+begin_src R :exports both
sleep
#+end_src

#+RESULTS:
| extra | group | ID |
|-------+-------+----|
|   0.7 |     1 |  1 |
|  -1.6 |     1 |  2 |
|  -0.2 |     1 |  3 |
|  -1.2 |     1 |  4 |
|  -0.1 |     1 |  5 |
|   3.4 |     1 |  6 |
|   3.7 |     1 |  7 |
|   0.8 |     1 |  8 |
|     0 |     1 |  9 |
|     2 |     1 | 10 |
|   1.9 |     2 |  1 |
|   0.8 |     2 |  2 |
|   1.1 |     2 |  3 |
|   0.1 |     2 |  4 |
|  -0.1 |     2 |  5 |
|   4.4 |     2 |  6 |
|   5.5 |     2 |  7 |
|   1.6 |     2 |  8 |
|   4.6 |     2 |  9 |
|   3.4 |     2 | 10 |

*** warpbreaks (poisson)

- カウントデータ
- 織機毎の故障の数
#+begin_src R :results output code :exports both
data(warpbreaks)
str(warpbreaks)
#+end_src

#+RESULTS:
#+begin_src R

'data.frame':	54 obs. of  3 variables:
 $ breaks : num  26 30 54 25 70 52 51 26 67 18 ...
 $ wool   : Factor w/ 2 levels "A","B": 1 1 1 1 1 1 1 1 1 1 ...
 $ tension: Factor w/ 3 levels "L","M","H": 1 1 1 1 1 1 1 1 1 2 ...
#+end_src


#+begin_src R :exports both
sleep
#+end_src

#+RESULTS:
| extra | group | ID |
|-------+-------+----|
|   0.7 |     1 |  1 |
|  -1.6 |     1 |  2 |
|  -0.2 |     1 |  3 |
|  -1.2 |     1 |  4 |
|  -0.1 |     1 |  5 |
|   3.4 |     1 |  6 |
|   3.7 |     1 |  7 |
|   0.8 |     1 |  8 |
|     0 |     1 |  9 |
|     2 |     1 | 10 |
|   1.9 |     2 |  1 |
|   0.8 |     2 |  2 |
|   1.1 |     2 |  3 |
|   0.1 |     2 |  4 |
|  -0.1 |     2 |  5 |
|   4.4 |     2 |  6 |
|   5.5 |     2 |  7 |
|   1.6 |     2 |  8 |
|   4.6 |     2 |  9 |
|   3.4 |     2 | 10 |

*** List

#+begin_src R :rownames yes :exports both
pacman::p_data(ggplot2)
#+end_src

#+RESULTS:
|    | Data           | Description                                                       |
|----+----------------+-------------------------------------------------------------------|
|  1 | diamonds       | Prices of over 50,000 round cut diamonds                          |
|  2 | economics      | US economic time series                                           |
|  3 | economics_long | US economic time series                                           |
|  4 | faithfuld      | 2d density estimate of Old Faithful data                          |
|  5 | luv_colours    | 'colors()' in Luv space                                           |
|  6 | midwest        | Midwest demographics                                              |
|  7 | mpg            | Fuel economy data from 1999 to 2008 for 38 popular models of cars |
|  8 | msleep         | An updated and expanded version of the mammals sleep dataset      |
|  9 | presidential   | Terms of 11 presidents from Eisenhower to Obama                   |
| 10 | seals          | Vector field of seal movements                                    |
| 11 | txhousing      | Housing sales in TX                                               |

*** List

#+begin_src R :rownames yes :exports both
pacman::p_data(dplyr)
#+end_src

#+RESULTS:
|   | Data              | Description               |
|---+-------------------+---------------------------|
| 1 | band_instruments  | Band membership           |
| 2 | band_instruments2 | Band membership           |
| 3 | band_members      | Band membership           |
| 4 | nasa              | NASA spatio-temporal data |
| 5 | starwars          | Starwars characters       |
| 6 | storms            | Storm tracks data         |

*** List

#+begin_src R :exports both
pacman::p_data(mlbench)
#+end_src

#+RESULTS:
| Data                 | Description                                     |
|----------------------+-------------------------------------------------|
| BostonHousing        | Boston Housing Data                             |
| BostonHousing2       | Boston Housing Data                             |
| BreastCancer         | Wisconsin Breast Cancer Database                |
| DNA                  | Primate splice-junction gene sequences (DNA)    |
| Glass                | Glass Identification Database                   |
| HouseVotes84         | United States Congressional Voting Records 1984 |
| Ionosphere           | Johns Hopkins University Ionosphere database    |
| LetterRecognition    | Letter Image Recognition Data                   |
| Ozone                | Los Angeles ozone pollution data, 1976          |
| PimaIndiansDiabetes  | Pima Indians Diabetes Database                  |
| PimaIndiansDiabetes2 | Pima Indians Diabetes Database                  |
| Satellite            | Landsat Multi-Spectral Scanner Image Data       |
| Servo                | Servo Data                                      |
| Shuttle              | Shuttle Dataset (Statlog version)               |
| Sonar                | Sonar, Mines vs. Rocks                          |
| Soybean              | Soybean Database                                |
| Vehicle              | Vehicle Silhouettes                             |
| Vowel                | Vowel Recognition (Deterding data)              |
| Zoo                  | Zoo Data                                        |

*** List

#+begin_src R :exports both
pacman::p_data(modeldata)
#+end_src

#+RESULTS:
| Data                             | Description                                             |
|----------------------------------+---------------------------------------------------------|
| Chicago                          | Chicago ridership data                                  |
| Sacramento                       | Sacramento CA home prices                               |
| Smithsonian                      | Smithsonian museums                                     |
| ad_data                          | Alzheimer's disease data                                |
| attrition                        | Job attrition                                           |
| biomass                          | Biomass data                                            |
| car_prices                       | Kelly Blue Book resale data for 2005 model year GM cars |
| cells                            | Cell body segmentation                                  |
| check_times                      | Execution time data                                     |
| concrete                         | Compressive strength of concrete mixtures               |
| covers                           | Raw cover type data                                     |
| credit_data                      | Credit data                                             |
| drinks                           | Sample time series data                                 |
| hpc_cv                           | Class probability predictions                           |
| hpc_data                         | High-performance computing system data                  |
| lending_club                     | Loan data                                               |
| meats                            | Fat, water and protein content of meat samples          |
| mlc_churn                        | Customer churn data                                     |
| oils                             | Fatty acid composition of commercial oils               |
| okc                              | OkCupid data                                            |
| okc_text                         | OkCupid text data                                       |
| parabolic                        | Parabolic class boundary data                           |
| pathology                        | Liver pathology data                                    |
| pd_speech                        | Parkinson's disease speech classification data set      |
| scat                             | Morphometric data on scat                               |
| solubility_test                  | Solubility predictions from MARS model                  |
| stackoverflow                    | Annual Stack Overflow Developer Survey Data             |
| stations (Chicago)               | Chicago ridership data                                  |
| testing_data (small_fine_foods)  | Fine foods example data                                 |
| training_data (small_fine_foods) | Fine foods example data                                 |
| two_class_dat                    | Two class data                                          |
| two_class_example                | Two class predictions                                   |
| wa_churn                         | Watson churn data                                       |

*** List

- 2013 年にニューヨークから出航した航空機のリスト
  - EWR: ニューアーク・リバティー国際空港
  - JFK: ジョン・ F ・ケネディ国際空港
  - LGA: ラガーディア空港
- 主に遅延の原因を分析するためのデータ

- 1 つのパッケージにいくつかのデータセットが含まれている
  - =flights=: all flights that departed from NYC in 2013
  - =weather=: hourly meterological data for each airport
  - =planes=: construction information about each plane
  - =airports=: airport names and locations
  - =airlines=: translation between two letter carrier codes and names

#+begin_src R :rownames yes :exports both
pacman::p_data(nycflights13)
#+end_src

#+RESULTS:
|   | Data     | Description         |
|---+----------+---------------------|
| 1 | airlines | Airline names.      |
| 2 | airports | Airport metadata    |
| 3 | flights  | Flights data        |
| 4 | planes   | Plane metadata.     |
| 5 | weather  | Hourly weather data |

*** List

- Julian Faraway の著書をサポートするパッケージ
#+begin_src R :rownames yes :exports both
pacman::p_data(faraway)
#+end_src

#+RESULTS:
|     | Data         | Description                                                               |
|-----+--------------+---------------------------------------------------------------------------|
|   1 | aatemp       | Annual mean temperatures in Ann Arbor, Michigan                           |
|   2 | abrasion     | Wear on materials according to type, run and position                     |
|   3 | aflatoxin    | aflatoxin dosage and liver cancer in lab animals                          |
|   4 | africa       | miltary coups and politics in sub-Saharan Africa                          |
|   5 | airpass      | Airline passengers                                                        |
|   6 | alfalfa      | Effects of seed inoculum, irrigation and shade on alfalfa yield           |
|   7 | amlxray      | Match pair study for AML and Xray link                                    |
|   8 | anaesthetic  | Time in minutes to eye opening after reversal of anaesthetic.             |
|   9 | babyfood     | Respiratory disease rates of babies fed in different ways                 |
|  10 | beetle       | Beetles exposed to fumigant                                               |
|  11 | bliss        | Insect mortality due to insecticide                                       |
|  12 | breaking     | Breaking strength of materials                                            |
|  13 | broccoli     | Broccoli weight variation                                                 |
|  14 | butterfat    | Butterfat content of milk by breed                                        |
|  15 | cathedral    | Cathedral nave heights and lengths in England                             |
|  16 | cheddar      | Taste of Cheddar cheese                                                   |
|  17 | chicago      | Chicago insurance redlining                                               |
|  18 | chiczip      | Chicago zip codes north-south                                             |
|  19 | chmiss       | Chicago insurance redlining                                               |
|  20 | choccake     | Chocolate cake experiment with split plot design                          |
|  21 | chredlin     | Chicago insurance redlining                                               |
|  22 | clot         | Blood clotting times                                                      |
|  23 | cmob         | Social class mobility from 1971 to 1981 in the UK                         |
|  24 | cns          | Malformations of the central nervous system                               |
|  25 | coagulation  | Blood coagulation times by diet                                           |
|  26 | composite    | Strength of a thermoplastic composite depending on two factors            |
|  27 | cornnit      | Corn yields from nitrogen application                                     |
|  28 | corrosion    | Corrosion loss in Cu-Ni alloys                                            |
|  29 | cpd          | Projected and actual sales of 20 consumer products                        |
|  30 | crawl        | Crawling babies by month                                                  |
|  31 | ctsib        | Effects of surface and vision on balance.                                 |
|  32 | death        | Death penalty in Florida 1977                                             |
|  33 | debt         | psychology of debt                                                        |
|  34 | denim        | Denim wastage by supplier                                                 |
|  35 | diabetes     | Diabetes and obesity, cardiovascular risk factors                         |
|  36 | dicentric    | Radiation dose effects on chromosomal abnormality                         |
|  37 | divusa       | Divorce in the USA 1920-1996                                              |
|  38 | drugpsy      | Choice of drug treatment for psychiatry patients                          |
|  39 | dvisits      | Doctor visits in Australia                                                |
|  40 | eco          | Ecological regression example                                             |
|  41 | eggprod      | Treatment and block effects on egg production                             |
|  42 | eggs         | Nested data on lab testing of eggs                                        |
|  43 | epilepsy     | Epileptic seizures in clinical trial of drug                              |
|  44 | esdcomp      | Complaints about emergency room doctors                                   |
|  45 | exa          | Simulated non-parametric regression data                                  |
|  46 | exb          | Simulated non-parametric regression data                                  |
|  47 | eyegrade     | grading of eye pairs for distance vision                                  |
|  48 | fat          | Percentage of Body Fat and Body Measurements                              |
|  49 | femsmoke     | Mortality due to smoking according age group in women                     |
|  50 | fortune      | Billionaires' wealth and age                                              |
|  51 | fpe          | 1981 French Presidential Election                                         |
|  52 | fruitfly     | Longevity of fruiflies depending on sexual activity and thorax length     |
|  53 | gala         | Species diversity on the Galapagos Islands                                |
|  54 | gammaray     | Xray decay from a gamma ray burst                                         |
|  55 | gavote       | Undercounted votes in Georgia in 2000 presidential election               |
|  56 | globwarm     | Northern Hemisphere temperatures and climate proxies in the last millenia |
|  57 | haireye      | Hair and eye color                                                        |
|  58 | happy        | love, work and happiness                                                  |
|  59 | hemoglobin   | Treatment of insulin dependent diabetic children                          |
|  60 | hips         | Ankylosing Spondylitis                                                    |
|  61 | hormone      | Hormone concentrations in gay and straight men                            |
|  62 | hprice       | Housing prices in US cities 86-94                                         |
|  63 | hsb          | Career choice of high school students                                     |
|  64 | infmort      | Infant mortality according to income and region                           |
|  65 | insulgas     | Effects of insulation on gas consumption                                  |
|  66 | irrigation   | Irrigation methods in an agricultural field trial                         |
|  67 | jsp          | Junior School Project                                                     |
|  68 | kanga        | Kangaroo skull measurements                                               |
|  69 | lawn         | Cut-off times of lawnmowers                                               |
|  70 | leafblotch   | Leaf blotch on barley                                                     |
|  71 | leafburn     | Data on the burning time of samples of tobacco leaves                     |
|  72 | mammalsleep  | Sleep in Mammals: Ecological and Constitutional Correlates                |
|  73 | manilius     | Mayer's 1750 data on the Manilius crater on the moon                      |
|  74 | meatspec     | Meat spectrometry to determine fat content                                |
|  75 | melanoma     | Melanoma by type and location                                             |
|  76 | motorins     | Third party motor insurance claims in Sweden in 1977                      |
|  77 | neighbor     | Questionnaire study of neighborly help                                    |
|  78 | nels88       | National Education Longitudinal Study of 1988                             |
|  79 | nepali       | Nepali child heath study                                                  |
|  80 | nes96        | US 1996 national election study                                           |
|  81 | newhamp      | New Hampshire Democratic Party Primary 2008                               |
|  82 | oatvar       | Yields of oat varieties planted in blocks                                 |
|  83 | odor         | Odor of chemical by production settings                                   |
|  84 | ohio         | Ohio Children Wheeze Status                                               |
|  85 | orings       | Spache Shuttle Challenger O-rings                                         |
|  86 | ozone        | Ozone in LA in 1976                                                       |
|  87 | parstum      | Marijuana and parent alcohol and drug use                                 |
|  88 | peanut       | Carbon dioxide effects on peanut oil extraction                           |
|  89 | penicillin   | Penicillin yield by block and treatment                                   |
|  90 | phbirths     | Birth weights in Philadelphia                                             |
|  91 | pima         | Diabetes survey on Pima Indians                                           |
|  92 | pipeline     | NIST data on ultrasonic measurements of defects in the Alaska pipeline    |
|  93 | pneumo       | Pneumonoconiosis in coal miners                                           |
|  94 | potuse       | Marijuana usage by youth                                                  |
|  95 | prostate     | Prostate cancer surgery                                                   |
|  96 | psid         | Panel Study of Income Dynamics subset                                     |
|  97 | pulp         | Brightness of paper pulp depending on shift operator                      |
|  98 | punting      | Leg strength and punting                                                  |
|  99 | pvc          | Production of PVC by operator and resin railcar                           |
| 100 | pyrimidines  | Activity in pyrimidines                                                   |
| 101 | rabbit       | Rabbit weight gain by diet and litter                                     |
| 102 | ratdrink     | Rat growth weights affected by additives                                  |
| 103 | rats         | Effect of toxic agents on rats                                            |
| 104 | resceram     | Shape and plate effects on current noise in resistors                     |
| 105 | salmonella   | Salmonella reverse mutagenicity assay                                     |
| 106 | sat          | School expenditure and test scores from USA in 1994-95                    |
| 107 | savings      | Savings rates in 50 countries                                             |
| 108 | seatpos      | Car seat position depending driver size                                   |
| 109 | seeds        | Germination of seeds depending on moisture and covering                   |
| 110 | semicond     | Semiconductor split-plot experiment                                       |
| 111 | sexab        | Post traumatic stress disorder in abused adult females                    |
| 112 | sexfun       | Marital sex ratings                                                       |
| 113 | snail        | Snail production                                                          |
| 114 | solder       | Solder skips in printing circuit boards                                   |
| 115 | sono         | Sonoluminescence                                                          |
| 116 | soybean      | Germination failures for soybean seeds                                    |
| 117 | spector      | Teaching methods in Economics                                             |
| 118 | speedo       | Speedometer cable shrinkage                                               |
| 119 | star         | Star temperatures and light intensites                                    |
| 120 | stat500      | Marks in a statistics class                                               |
| 121 | stepping     | Stepping and effect on heart rate                                         |
| 122 | strongx      | Strong interaction experiment data                                        |
| 123 | suicide      | Suicide method data from the UK                                           |
| 124 | teengamb     | Study of teenage gambling in Britain                                      |
| 125 | toenail      | Toenail infection treatment study                                         |
| 126 | troutegg     | Survival of trout eggs depending on time and location                     |
| 127 | truck        | Truck leaf spring experiment                                              |
| 128 | turtle       | Incubation temperature and the sex of turtles                             |
| 129 | tvdoctor     | Life, TVs and Doctors                                                     |
| 130 | twins        | Twin IQs from Burt                                                        |
| 131 | uncviet      | UNC student opinions about the Vietnam War                                |
| 132 | uswages      | Weekly wages of US male workers in 1988                                   |
| 133 | vision       | Acuity of vision in response to light flash                               |
| 134 | wafer        | resitivity of wafer in semiconductor experiment                           |
| 135 | wavesolder   | Defects in a wave soldering process                                       |
| 136 | wbca         | Wisconsin breast cancer database                                          |
| 137 | wcgs         | Western Collaborative Group Study                                         |
| 138 | weldstrength | welding strength DOE                                                      |
| 139 | wheat        | Insect damage to wheat by variety                                         |
| 140 | worldcup     | Data on players from the 2010 World Cup                                   |

** Binary Task

#+begin_src R :exports both
data_binary <- function(n = 1000, p = 5, seed = 1983) {
  set.seed(seed)
  x <- matrix(rnorm(n*p), n*p/p)
  coef <- rnorm(p)
  z <- x %*% coef
  prob <- 1 / (1 + exp(-z)) # inv-logit
  y <- rbinom(n, 1, prob) # prob can be vector
  mat <- cbind(y, x)
  colnames(mat) <- c("y", paste0("x", 1:p))
  tibble::as_tibble(mat) %>% dplyr::mutate(y = as.factor(y))
}

data_binary() %>% head() %>% mutate_if(is.numeric, round, digits=3)
#+end_src

#+RESULTS:
| y |     x1 |     x2 |     x3 |     x4 |     x5 |
|---+--------+--------+--------+--------+--------|
| 1 | -0.017 |  0.469 | -0.636 |  0.655 |  0.151 |
| 0 | -0.784 | -1.127 | -1.665 | -0.374 |  0.296 |
| 1 |  1.327 |  1.098 |  1.663 |   1.23 | -0.674 |
| 1 | -0.232 |  1.319 |  0.143 |  0.323 | -1.195 |
| 0 | -1.664 |  1.926 |  2.102 | -0.265 |  1.014 |
| 1 |  1.997 | -0.537 |  2.509 | -0.017 |  0.119 |

** Multiclass Task

#+begin_src R :exports both
data_multiclass <- function(n = 1000, p = 5, seed = 1983) {
  set.seed(seed)
  x <- matrix(rnorm(n*p), n*p/p)
  coef1 <- rnorm(p)
  coef2 <- rnorm(p)
  coef3 <- rnorm(p)

  probs <- cbind(exp(x %*% coef1), exp(x %*% coef2), exp(x %*% coef3))
  choices <- t(apply(probs, 1, rmultinom, n = 1, size = 1))
  y <- apply(choices, 1, function(x) which(x==1))
  mat <- cbind(y, x)
  colnames(mat) <- c("y", paste0("x", 1:p))
  tibble::as_tibble(mat) %>% dplyr::mutate(y = as.factor(y))
}

data_multiclass() %>% head() %>% mutate_if(is.numeric, round, digits=3)
#+end_src

#+RESULTS:
| y |     x1 |     x2 |     x3 |     x4 |     x5 |
|---+--------+--------+--------+--------+--------|
| 1 | -0.017 |  0.469 | -0.636 |  0.655 |  0.151 |
| 2 | -0.784 | -1.127 | -1.665 | -0.374 |  0.296 |
| 1 |  1.327 |  1.098 |  1.663 |   1.23 | -0.674 |
| 1 | -0.232 |  1.319 |  0.143 |  0.323 | -1.195 |
| 3 | -1.664 |  1.926 |  2.102 | -0.265 |  1.014 |
| 2 |  1.997 | -0.537 |  2.509 | -0.017 |  0.119 |

** Regression Task

#+begin_src R :exports both
data_regression <- function(n = 1000, p = 5, seed = 1983) {
  set.seed(seed)
  x <- matrix(rnorm(n*p), n*p/p)
  coef <- rnorm(p)
  y <- x %*% coef
  mat <- cbind(y, x)
  colnames(mat) <- c("y", paste0("x", 1:p))
  tibble::as_tibble(mat)
}

data_regression() %>% head() %>% mutate_if(is.numeric, round, digits=3)
#+end_src

#+RESULTS:
|      y |     x1 |     x2 |     x3 |     x4 |     x5 |
|--------+--------+--------+--------+--------+--------|
|  1.577 | -0.017 |  0.469 | -0.636 |  0.655 |  0.151 |
| -3.385 | -0.784 | -1.127 | -1.665 | -0.374 |  0.296 |
|  6.603 |  1.327 |  1.098 |  1.663 |   1.23 | -0.674 |
|  4.245 | -0.232 |  1.319 |  0.143 |  0.323 | -1.195 |
| -3.186 | -1.664 |  1.926 |  2.102 | -0.265 |  1.014 |
|  1.453 |  1.997 | -0.537 |  2.509 | -0.017 |  0.119 |

** Poisson Regression Task

#+begin_src R
data_poisson <- function(n = 1000, p = 5, seed = 1983) {
  set.seed(seed)
  x <- matrix(rnorm(n*p), n*p/p)
  coef <- rnorm(p)
  print(coef)
  lambda <- exp(x %*% coef)
  y <- rpois(n, lambda) # prob can be vector
  mat <- cbind(y, x)
  colnames(mat) <- c("y", paste0("x", 1:p))
  tibble::as_tibble(mat) %>% dplyr::mutate(y = as.integer(y))
}

data_poisson() %>% head() %>% mutate_if(is.numeric, round, digits=3)
#+end_src

#+RESULTS:
|   y |     x1 |     x2 |     x3 |     x4 |     x5 |
|-----+--------+--------+--------+--------+--------|
|   5 | -0.017 |  0.469 | -0.636 |  0.655 |  0.151 |
|   0 | -0.784 | -1.127 | -1.665 | -0.374 |  0.296 |
| 690 |  1.327 |  1.098 |  1.663 |   1.23 | -0.674 |
|  58 | -0.232 |  1.319 |  0.143 |  0.323 | -1.195 |
|   0 | -1.664 |  1.926 |  2.102 | -0.265 |  1.014 |
|   5 |  1.997 | -0.537 |  2.509 | -0.017 |  0.119 |

